[
  {
    "id": "002eff2a-d0cc-4fb4-b77c-750214fb919a",
    "name": "behavior",
    "description": "Behaviors allow you to bundle together some hyperscript code (that would normally go in the _ attribute of an element) so that it can be \"installed\" on any other.\nFor instance, consider this disappearing div:\nThis revolutionary UI technology impresses the client, and they come to you with a list of other components that they would like to be Removable™. Do you copy this code to each of those elements? That would work, but is not ideal, since\nThis code is highly experimental, you'd like to be able to change it in just one place.\nYour boss is considering licensing the Removable™ tech to other companies.\nTo remedy this, you can define a behavior:\n<!-- I've never actually had a job, so I'm just imitating stories from techtalks. This is what the industry is like, right? -->\nand install it in your elements:\nSo far, so good! Until you come across this:\nHow do we implement this? We could create a new behavior, but we'd have to duplicate our highly sophisticated logic. Thankfully, behaviors can accept arguments:",
    "syntax_canonical": "behavior <name>(<parameter list>)\n  {<hyperscript>}\nend",
    "trigger": null,
    "structure_description": null,
    "scope_impact": null,
    "status": "Draft",
    "created_at": "2025-05-21T19:43:36.407Z",
    "updated_at": "2025-05-21T19:43:36.407Z",
    "source_info_id": null
  },
  {
    "id": "82e15f83-ef3b-4b0e-ba90-8ca42ac7406a",
    "name": "def",
    "description": "The def keyword allows you to define functions in hyperscript. It consists of a function name, a parameter listand a body with an optional catch and/or an optional finally block.\nThe body of the function is a list of commands, optionally separated by the then keyword.\nFunctions are typically placed in script tags:\nYou may also namespace functions by giving them a dot separated namespace\nFunctions may be invoked from both hyperscript or javascript. However, in javascript, an asynchronous function willreturn a promise that must be dealt with explicitly.\nValues may be returned with the return command. If the function is synchronous, the value will be returned as normaland if it is asynchronous, the promise will be resolved. The hyperscript runtime hides this difference when thefunction is invoked within hyperscript.\nExceptions may be thrown with the throw command. If the function is synchronous, the exception will be thrown as normaland if it is asynchronous, the promise will be rejected. The hyperscript runtime hides this difference when thefunction is invoked within hyperscript.",
    "syntax_canonical": "def <function name>(<parameter list>)\n  {<command>}\n[catch <identifier>\n  {<command>}]\n[finally\n  {<command>}]\nend",
    "trigger": null,
    "structure_description": null,
    "scope_impact": null,
    "status": "Draft",
    "created_at": "2025-05-21T19:43:36.408Z",
    "updated_at": "2025-05-21T19:43:36.408Z",
    "source_info_id": null
  },
  {
    "id": "4451761c-9f45-4216-b71e-86fdd8787494",
    "name": "event-source",
    "description": "Note: if you want the event source feature, you must either use the \"Whole 9 Yards\" release of hyperscript, or include the /dist/eventsource.js file.\nServer Sent Events are a simple way for your web server to push information directly to your clients that is supported by all modern browsers. They provide real-time, uni-directional communication from your server to a browser. Server Sent Events cannot sent information back to your server. If you need two-way communication, consider implementing WebSockets instead.\nSSE connections can require substantial work to set up and maintain. For example, browsers are supposed to reconnect to a failed SSE stream automatically, but their behavior differs. Hyperscript manages everything for you, and reconnects connections that have failed, so your code only has to handle incoming messages.\nThe SSE specification requires that every event listener must declare a specific event name that it will listen to. There is no ability to designate a \"catch all\" handler for any unnamed events. This means that you will need to know exactly what event names are being sent, and will need to write specific event handlers for each one.",
    "syntax_canonical": "eventsource ChatUpdates from http://myserver.com/chat-updates\n\n  on newMessage as json\n    log it\n  end\n\n  on updateMessage as json\n    log it\n  end\n\nend",
    "trigger": null,
    "structure_description": null,
    "scope_impact": null,
    "status": "Draft",
    "created_at": "2025-05-22T15:38:26.105Z",
    "updated_at": "2025-05-22T15:38:26.105Z",
    "source_info_id": null
  },
  {
    "id": "01de0725-8df6-450d-a62f-485842dee189",
    "name": "init",
    "description": "The init keyword allows you to run some hyperscript when an element initializes. By default, it will execute afterall features have been evaluated. If you add the immediately modifier, it will run immediately, which can be usefulfrom a timing perspective, but note that features defined after the init (e.g. functions) will not be available.",
    "syntax_canonical": "init [immediately]\n  {<command>}\nend",
    "trigger": null,
    "structure_description": null,
    "scope_impact": null,
    "status": "Draft",
    "created_at": "2025-05-22T15:38:26.105Z",
    "updated_at": "2025-05-22T15:38:26.105Z",
    "source_info_id": null
  },
  {
    "id": "bf030de3-3e85-4b66-8657-18bc5fabc116",
    "name": "js",
    "description": "Note: This page is about the top-level JS feature. _hyperscript also supports inline JS as a command, say, inside an event listener or function.\nTop-level JavaScript can be used in a <script type=text/hyperscript> block, as shown:\nfunction declarations inside a JS block will be exposed to the global scope (let, var, const declarations will not be exposed). As a result, this function can then be used in _hyperscript code:\nIf you don't want to expose all the functions, return an object containing those that you do want to expose:\njs blocks can also be placed in workers:\nthis inside a js block is the global scope (window, or self in workers).\n{% include \"js_end.md\" %}",
    "syntax_canonical": "js\n    function regexFind(re, group, str) {\n        return new RegExp(re).exec(str)[group];\n    }\n\n    return { regexFind };\nend",
    "trigger": null,
    "structure_description": null,
    "scope_impact": null,
    "status": "Draft",
    "created_at": "2025-05-21T19:43:36.408Z",
    "updated_at": "2025-05-21T19:43:36.408Z",
    "source_info_id": null
  },
  {
    "id": "d2a61e43-b97d-4799-b30e-3c4811fe31a3",
    "name": "on",
    "description": "Event handlers are used to handle events with hyperscript. They are typically embedded directly on the element thatis responding to the event.\nIf the every prefix is used, the event handler will not be synchronized (see queueing below.)\nThe event-name can be a symbol, a dot-separated symbol or a string that names the event. The most obvious eventsof interest are are standard HTML DOM events such as click,focus/blur, change, etc. There are many, many standard browser events thatmay be of interest depending on what you are trying to build. You may also wish to define your own events for higher level abstractions.\nThe optional param-list is a comma separated list of parameter names. Parameters will be set from properties directlyon the event or in the details property.\nThe optional filter is a boolean expression that will filter the event. Symbols in the expression will be resolvedagainst the event first, then against the global scope.\nThe optional count is a count filter with a value of either a specific number, a range or an unbounded start:",
    "syntax_canonical": "on [every] <event-name>[(<param-list>)][\\[<filter>\\]] [<count>] [from <expr>] [<debounce> | <throttle>]\n   { or [every] <event-name>[(<param-list>)][\\[<filter>\\]] [<count>] [from <expr>] [<debounce> | <throttle>] }\n    [queue (all | first | last | none)]\n    {<command>}\n[end]",
    "trigger": null,
    "structure_description": null,
    "scope_impact": null,
    "status": "Draft",
    "created_at": "2025-05-21T19:43:36.408Z",
    "updated_at": "2025-05-21T19:43:36.408Z",
    "source_info_id": null
  },
  {
    "id": "378052eb-00ab-4677-a7b2-2e477e422010",
    "name": "set",
    "description": "The set feature allows you to set an element scoped variable to a value. When used as a top-level feature, onlyelement-scoped variables are supported.\nSee the set command for more information.",
    "syntax_canonical": "set <expression> to <expression>",
    "trigger": null,
    "structure_description": null,
    "scope_impact": null,
    "status": "Draft",
    "created_at": "2025-05-21T19:43:36.405Z",
    "updated_at": "2025-05-21T19:43:36.405Z",
    "source_info_id": null
  },
  {
    "id": "9e535a0d-c3ef-44ed-a5fc-1915a1580b18",
    "name": "socket",
    "description": "Note: if you want the socket feature, you must either use the \"Whole 9 Yards\" release of hyperscript, or include the /dist/socket.js file.\n<br/>\nsocket-name is a name for the socket. This is available in the current hypertext scope and exposes additional data about the browser WebSocket object.\nsocket-url is the address that the socket is connected to. Schemes like ws or wss can optionally be specified (like in socket MySocket ws://myserver.com/example). If not specified, hyperscript defaults to add the location's scheme-type, host and port (like in socket MySocket /example).\nwith timeout <time expr> allows you to set a default timeout for RPC calls.\non message is an optional message handler body that can be run when messages are received. The message symbolwill be set to the message value. The optional as json modifier will convert the message to json before runningthe handler.\nWeb Sockets provide a mechanism for two-way communicationbetween a browser client and a server. Hyperscript provides a simple way to create them, as well as a simpleRemote Procedure Call (RPC) mechanism layered on top of them.",
    "syntax_canonical": "socket <socket-name> <socket-url> [with timeout <time expr>]\n    [on message [as json] <command-list>]",
    "trigger": null,
    "structure_description": null,
    "scope_impact": null,
    "status": "Draft",
    "created_at": "2025-05-22T15:38:26.104Z",
    "updated_at": "2025-05-22T15:38:26.104Z",
    "source_info_id": null
  },
  {
    "id": "b76abd9b-b466-4e17-ac24-87b6c54d4945",
    "name": "worker",
    "description": "Note: if you want the worker feature, you must either use the \"Whole 9 Yards\" release of hyperscript, or include the /dist/workers.js file.\n_hyperscript allows you to create Web Workers whose functions are exposed to the main thread.\nAny function declarations (declared with def) will be exposed on the main thread, so the above worker can be invoked as Incrementer.increment(4) in either _hyperscript or JavaScript. The body of the function will then run in the worker and the result returned asynchronously to the main thread. As a result, the worker feature can be used to perform calculations in a non-blocking way, and although these worker functions return promises, _hyperscript's [async-transparent] nature means we can call it as if it were synchronous. In summary:\nFunctions are declared in workers\nThey can be called from the main thread just like normal functions\nThey return promises\nWhen calling worker functions from _hyperscript code, you don't need to worry about this fact\nBecause it runs in a Web Worker, the code inside a worker body cannot access the DOM or the window global scope. It also can't access scripts included in the main thread, which is what the external-scripts feature is for. URLs passed in as external scripts, if relative, need to be relative to the HTML document which spawns the worker.",
    "syntax_canonical": "worker Incrementer\n  js\n    function _increment(n) { return n + 1 }\n  end\n  def increment(n) return _increment(n) end\nend",
    "trigger": null,
    "structure_description": null,
    "scope_impact": null,
    "status": "Draft",
    "created_at": "2025-05-22T15:38:26.106Z",
    "updated_at": "2025-05-22T15:38:26.106Z",
    "source_info_id": null
  }
]